# UIThemeManager Properties (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
UIThemeManager Properties
UIThemeManager Class See Also
---
The UIThemeManager type exposes the following members.
# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| CurrentCanvasTheme | current canvas theme. |
| CurrentTheme | The current overall theme which impacts the Revit frame and canvas. |
| DefaultTheme | **Obsolete.** The default theme. |
| FollowSystemColorTheme | Indicate if the overall theme follows operating system color theme. |

# See Also
UIThemeManager Class
Autodesk.Revit.UI Namespace